{
    "projects":[
      {
        "id": 0,
        "project_name": "What Would An Architect Say",
        "description": "A random quote generator is an app that displays random quotes by famous architects each time the button 'show another quote' is clicked. An app also automatically refreshes quotes after 20s and chooses random background color.",
        "technologies": ["Vanilla JavaScript"],
        "live_link": "https://monifra.github.io/A-Random-Quote-Generator/",
        "github_link": "https://github.com/monifra/A-Random-Quote-Generator",
        "image_urls":["/static/images/Architect-1-square.jpg","/static/images/Architect-1.jpg","/static/images/Architect-2.jpg","/static/images/Architect-3.jpg","/static/images/Architect-4.jpg"]
      },
      {
        "id": 1,
        "project_name": "List Pagination And Filtering",
        "description": "In this project I enhance the web page with pagination technique. List Filter and Pagination project uses pagination technique to show maximum ten students at the page. It creates a navigation to let the user see the rest of the student by clicking on links inside the navigation. It has a search bar that allows to search the list of student, shows ones that match, adds pagination if there are more than ten results, adjust in real time when you change the words you search and throws an error message when no match were found.",
        "technologies": ["Vanilla JavaScript"],
        "live_link": "https://monifra.github.io/List_Pagination_And_Filtering",
        "github_link": "https://github.com/monifra/List_Pagination_And_Filtering",
        "image_urls":["/static/images/Pagination-1-square.jpg","/static/images/Pagination-1.jpg","/static/images/Pagination-2.jpg","/static/images/Pagination-3.jpg"]

      },
      {
        "id": 2,
        "project_name": "Interactive Form",
        "description": "Interactive Form Project is an interactive registration form for tech conference. In this project I'm using jQuery library. Form is using some customise behaviours, such as hiding unnecessary input fields or unnecessary select options. All of the validations for this form are powered by javaScript and provide helpful notes when the users data are invalid. I'm using Progressive Enhancement technique to make this form work, even if the user has enabled javaScript.\n\nWhen user visit the page it automatically focus on a first name input. Then there is a job section, when the user selects other job option, the input for other job appears. In the t-shirt section form allows you to select only t-shirt colour that is possible in your selected t-shirt theme. Until theme is selected you can't select the colour. In activities section you have to choose at least one activity, form automatically disabled activities that are scheduled at the same time as your already selected activity. The last section is payment. As a default it is set to show Credit Card as payment option. You can change payment option to PyPal or Bitcoin and you will see payment information for chosen payment option. When you click submit button and some information are invalid you will see error messages. When you try to submit an empty form you will see an error message for all required fields.",
        "technologies": ["jQuery"],
        "live_link": " https://monifra.github.io/Interactive-Form/",
        "github_link": "https://github.com/monifra/Interactive-Form",
        "image_urls":["/static/images/Form-1-square.jpg","/static/images/Form-1.jpg","/static/images/Form-2.jpg","/static/images/Form-3.jpg"]

      },
      {
        "id": 3,
        "project_name": "OOP Game Show App",
        "description": "OOP Game Show App is a browser based game in which player has to guess movie quotes. Every time the game runs it generates new movie quote and hides it under tiles. When player clicks a keyboard letter (in window or physical) the program checks if the letter exists in the phrase. If the letter exists in the phrase, it is unveiled if not player loses one \"life\". All keyboard buttons can be clicked only once, one click unveils all matching letters in a hidden phrase. The game continues until all letters in the phrase are guessed or there are no \"lives\" left.\n",
        "technologies": ["Vanilla JavaScript", "Object Oriented Programming"],
        "live_link": "https://monifra.github.io/OOP-Game-Show-App/",
        "github_link": "https://github.com/monifra/OOP-Game-Show-App",
        "image_urls":["/static/images/Game-1-square.jpg","/static/images/Game-1.jpg","/static/images/Game-2.jpg","/static/images/Game-3.jpg","/static/images/Game-4.jpg"]

      },
      {
        "id": 4,
        "project_name": "Public API Request",
        "description": "Public API Request is an app for a fictional company called Awesome Startup. It grabs information for 12 randomly generated employees and use the data to build 12 user cards. App requests JSON object from the API https://randomuser.me, and parse the data to generate our users cards (it takes user image, full name, email and location). After clicking on employee card modal window opens. Modal window shows employees detailed information like full address and birthday.",
        "technologies": ["Vanilla Javascript", "Public API Requests"],
        "live_link": "https://monifra.github.io/Public-API-Request",
        "github_link": "https://github.com/monifra/Public-API-Request",
        "image_urls":["/static/images/Api-1-square.jpg","/static/images/Api-1.jpg","/static/images/Api-2.jpg","/static/images/Api-3.jpg"]
      }
    ]
}